/* Напишите программу, которая на вход принемает число и выдает его квадрат
 (число умноженное на само себя) */

Console.WriteLine("Введите число:");
int number = int.Parse(Console.ReadLine());

//квадрат входного числа
int result = number * number;

//вывод результата
Console.WriteLine($"квадрат входного числа: {result}");




